#Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.

#Напишите программу для. проверки истинности утверждения
#¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z (расшифровка этого выражения 
#not (x[0] or x[1] or x[2] = not x[0] and not x[1] and not x[2]) для всех значений предикат.


#Напишите программу, которая принимает на вход координаты точки 
#(X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка .


#Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).


#Напишите программу, которая принимает на вход координаты двух точек и 
#находит расстояние между ними в 2D пространстве